## Plan Result (prod_enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 4 to change, 2 to destroy.</code></pre>

* Create
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].time_rotating.rotation_period
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].time_rotating.rotation_period
* Update
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azurerm_key_vault_secret.sp_token
* Replace
  * module.subscription[&#34;MoJ Common Platform Operational Services&#34;].azuread_application_password.token
  * module.subscription[&#34;MoJ Common Platform Pre-Production&#34;].azuread_application_password.token




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["MoJ Common Platform Operational Services"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name          = (known after apply)
      ~ end_date              = "2025-07-20T07:06:00Z" -> (known after apply)
      ~ id                    = "97983fff-b312-4973-b0b6-748d705db678/password/9c803203-a776-4506-95ef-77e3fe8cd3b6" -> (known after apply)
      ~ key_id                = "9c803203-a776-4506-95ef-77e3fe8cd3b6" -> (known after apply)
      ~ rotate_when_changed   = { # forces replacement
          - "rotation" = "2023-07-20T07:06:00Z"
        } -> (known after apply) # forces replacement
      ~ start_date            = "2023-07-20T07:06:00Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["MoJ Common Platform Operational Services"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "a29ac3d8-c8d9-4bb4-9a56-f05d78cffd2c"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["MoJ Common Platform Operational Services"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c28d33a47ce9c9b5a3937kv.vault.azure.net/secrets/sp-token/db6f76fb045541d7aab627a72f904c8f"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["MoJ Common Platform Operational Services"].time_rotating.rotation_period will be created
  + resource "time_rotating" "rotation_period" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 90
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.subscription["MoJ Common Platform Pre-Production"].azuread_application_password.token must be replaced
-/+ resource "azuread_application_password" "token" {
      + display_name          = (known after apply)
      ~ end_date              = "2025-07-20T07:06:01Z" -> (known after apply)
      ~ id                    = "6466b883-b713-4329-b380-4fff0a91094a/password/b1e6f25e-76bd-456f-9bfa-b6fb06db2d88" -> (known after apply)
      ~ key_id                = "b1e6f25e-76bd-456f-9bfa-b6fb06db2d88" -> (known after apply)
      ~ rotate_when_changed   = { # forces replacement
          - "rotation" = "2023-07-20T07:06:00Z"
        } -> (known after apply) # forces replacement
      ~ start_date            = "2023-07-20T07:06:01Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.subscription["MoJ Common Platform Pre-Production"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                                     = "961aac0d-6eca-4dde-81b4-9b9e7d9fb99b"
        # (9 unchanged attributes hidden)

      ~ credentials {
          ~ serviceprincipalkey = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.subscription["MoJ Common Platform Pre-Production"].azurerm_key_vault_secret.sp_token will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sp_token" {
        id                      = "https://c3d84f7175ff8f4ee0a90kv.vault.azure.net/secrets/sp-token/2c3bf3d6d8824febb19457bbf15f18ca"
        name                    = "sp-token"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

  # module.subscription["MoJ Common Platform Pre-Production"].time_rotating.rotation_period will be created
  + resource "time_rotating" "rotation_period" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 90
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 4 to add, 4 to change, 2 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.subscription["MoJ Common Platform Operational Services"].time_rotating.rotation_period has been deleted
  - resource "time_rotating" "rotation_period" {
      - id               = "2023-07-20T07:06:00Z" -> null
        # (10 unchanged attributes hidden)
    }

  # module.subscription["MoJ Common Platform Pre-Production"].time_rotating.rotation_period has been deleted
  - resource "time_rotating" "rotation_period" {
      - id               = "2023-07-20T07:06:00Z" -> null
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":98,"Program":"tfcmt","SHA1":"","Target":"prod_enterprise","Vars":{}} -->